In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([10,2,3,4])
s

0    10
1     2
2     3
3     4
dtype: int64

In [3]:
s.dtype

dtype('int64')

In [4]:
s.values

array([10,  2,  3,  4])

In [5]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
s.name = 'Calories'

In [7]:
s

0    10
1     2
2     3
3     4
Name: Calories, dtype: int64

In [8]:
s[0]

np.int64(10)

In [9]:
s[0:2] # ending is not included

0    10
1     2
Name: Calories, dtype: int64

In [10]:
s.iloc[2]

np.int64(3)

In [11]:
s.iloc[[1,2]]

1    2
2    3
Name: Calories, dtype: int64

In [12]:
index = ['apple', 'mango', 'orange', 'grapes']

In [13]:
s.index=index
s

apple     10
mango      2
orange     3
grapes     4
Name: Calories, dtype: int64

In [14]:
s['grapes']

np.int64(4)

In [15]:
s.loc['mango':'grapes'] # ending is included

mango     2
orange    3
grapes    4
Name: Calories, dtype: int64

In [16]:
s.loc[['grapes','apple']]

grapes     4
apple     10
Name: Calories, dtype: int64

In [17]:
fruits_protein = {
    'avakado':2.0,
    'guava':2.6,
    'blackberies':2.0,
    'oranges':0.9,
    'banana':1.1,
    'apple':1.3,
    'kivi':1.1,
    'pomogranate':1.7,
    'mango':.8,
    'cheries':1
}

In [18]:
s2 = pd.Series(fruits_protein,name='protein')
s2

avakado        2.0
guava          2.6
blackberies    2.0
oranges        0.9
banana         1.1
apple          1.3
kivi           1.1
pomogranate    1.7
mango          0.8
cheries        1.0
Name: protein, dtype: float64

In [19]:
s2[(s2>1) & (s2<=2)]

avakado        2.0
blackberies    2.0
banana         1.1
apple          1.3
kivi           1.1
pomogranate    1.7
Name: protein, dtype: float64

In [20]:
data ={
    'name':['ajay','ram','sam','gopi','vinay'],
    'age':[20,25,np.nan,24,30],
    'department':['HR','IT','Finance','IT','HR'],
    'salary':[65000,50000,90000,99000,np.nan]
}

In [21]:
data

{'name': ['ajay', 'ram', 'sam', 'gopi', 'vinay'],
 'age': [20, 25, nan, 24, 30],
 'department': ['HR', 'IT', 'Finance', 'IT', 'HR'],
 'salary': [65000, 50000, 90000, 99000, nan]}

In [22]:
df = pd.DataFrame(data)

In [23]:
df

    name   age department   salary
0   ajay  20.0         HR  65000.0
1    ram  25.0         IT  50000.0
2    sam   NaN    Finance  90000.0
3   gopi  24.0         IT  99000.0
4  vinay  30.0         HR      NaN

In [24]:
df.head()

    name   age department   salary
0   ajay  20.0         HR  65000.0
1    ram  25.0         IT  50000.0
2    sam   NaN    Finance  90000.0
3   gopi  24.0         IT  99000.0
4  vinay  30.0         HR      NaN

In [25]:
df.tail(3)

    name   age department   salary
2    sam   NaN    Finance  90000.0
3   gopi  24.0         IT  99000.0
4  vinay  30.0         HR      NaN

In [26]:
df.iloc[1:2]

  name   age department   salary
1  ram  25.0         IT  50000.0

In [27]:
df.loc[1:3,['age','department']]

    age department
1  25.0         IT
2   NaN    Finance
3  24.0         IT

In [28]:
df.drop('age',axis=1)

    name department   salary
0   ajay         HR  65000.0
1    ram         IT  50000.0
2    sam    Finance  90000.0
3   gopi         IT  99000.0
4  vinay         HR      NaN

In [29]:
df

    name   age department   salary
0   ajay  20.0         HR  65000.0
1    ram  25.0         IT  50000.0
2    sam   NaN    Finance  90000.0
3   gopi  24.0         IT  99000.0
4  vinay  30.0         HR      NaN

In [30]:
df.shape

(5, 4)

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        5 non-null      object
 1   age         4 non-null      float64
 2   department  5 non-null      object
 3   salary      4 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

In [32]:
df.describe()

             age        salary
count   4.000000      4.000000
mean   24.750000  76000.000000
std     4.112988  22524.061209
min    20.000000  50000.000000
25%    23.000000  61250.000000
50%    24.500000  77500.000000
75%    26.250000  92250.000000
max    30.000000  99000.000000

In [33]:
#broadcasting
df['salary']+=5000

In [34]:
df

    name   age department    salary
0   ajay  20.0         HR   70000.0
1    ram  25.0         IT   55000.0
2    sam   NaN    Finance   95000.0
3   gopi  24.0         IT  104000.0
4  vinay  30.0         HR       NaN

In [35]:
df.rename(columns={'department':'Dept','name':'Name','age':'Age','salary':'Salary'},inplace=True)

In [36]:
df

    Name   Age     Dept    Salary
0   ajay  20.0       HR   70000.0
1    ram  25.0       IT   55000.0
2    sam   NaN  Finance   95000.0
3   gopi  24.0       IT  104000.0
4  vinay  30.0       HR       NaN

In [37]:
df['Dept'].unique()

array(['HR', 'IT', 'Finance'], dtype=object)

In [38]:
df['Dept'].value_counts()

Dept
HR         2
IT         2
Finance    1
Name: count, dtype: int64

In [39]:
df['Promated Salary']=df['Salary']*10
df

    Name   Age     Dept    Salary  Promated Salary
0   ajay  20.0       HR   70000.0         700000.0
1    ram  25.0       IT   55000.0         550000.0
2    sam   NaN  Finance   95000.0         950000.0
3   gopi  24.0       IT  104000.0        1040000.0
4  vinay  30.0       HR       NaN              NaN

In [40]:
df.isnull().sum()

Name               0
Age                1
Dept               0
Salary             1
Promated Salary    1
dtype: int64

In [41]:
df.dropna(how='all')

    Name   Age     Dept    Salary  Promated Salary
0   ajay  20.0       HR   70000.0         700000.0
1    ram  25.0       IT   55000.0         550000.0
2    sam   NaN  Finance   95000.0         950000.0
3   gopi  24.0       IT  104000.0        1040000.0
4  vinay  30.0       HR       NaN              NaN

In [42]:
df['Age'].fillna(df['Age'].mean())

0    20.00
1    25.00
2    24.75
3    24.00
4    30.00
Name: Age, dtype: float64

In [43]:
df['Age'].fillna(df['Age'].median())

0    20.0
1    25.0
2    24.5
3    24.0
4    30.0
Name: Age, dtype: float64

In [44]:
df['Age'].fillna(df['Age'].ffill())

0    20.0
1    25.0
2    25.0
3    24.0
4    30.0
Name: Age, dtype: float64

In [45]:
df['Age'].fillna(df['Age'].bfill())

0    20.0
1    25.0
2    24.0
3    24.0
4    30.0
Name: Age, dtype: float64

In [46]:
df['Name'].replace('vinay','rose')

0    ajay
1     ram
2     sam
3    gopi
4    rose
Name: Name, dtype: object

In [47]:
df['Promated Salary']=df['Promated Salary'].apply(lambda x:x/10)
df

    Name   Age     Dept    Salary  Promated Salary
0   ajay  20.0       HR   70000.0          70000.0
1    ram  25.0       IT   55000.0          55000.0
2    sam   NaN  Finance   95000.0          95000.0
3   gopi  24.0       IT  104000.0         104000.0
4  vinay  30.0       HR       NaN              NaN

In [48]:
depart_info ={
    'Dept':['IT','HR','Finance'],
    'Location':['New York','San Francisco', 'Chicago'],
    'Manager':['Lara','Ken','Phini']
}
df2=pd.DataFrame(depart_info)
df2

      Dept       Location Manager
0       IT       New York    Lara
1       HR  San Francisco     Ken
2  Finance        Chicago   Phini

In [49]:
pd.concat([df,df2],axis=1)

,Name,Age,Dept,Salary,Promated Salary,Dept,Location,Manager
0,ajay,20.0,HR,70000.0,70000.0,IT,New York,Lara
1,ram,25.0,IT,55000.0,55000.0,HR,San Francisco,Ken
2,sam,NaN,Finance,95000.0,95000.0,Finance,Chicago,Phini
3,gopi,24.0,IT,104000.0,104000.0,NaN,NaN,NaN
4,vinay,30.0,HR,NaN,NaN,NaN,NaN,NaN

In [50]:
pd.merge(df,df2,on='Dept')

    Name   Age     Dept    Salary  Promated Salary       Location Manager
0   ajay  20.0       HR   70000.0          70000.0  San Francisco     Ken
1    ram  25.0       IT   55000.0          55000.0       New York    Lara
2    sam   NaN  Finance   95000.0          95000.0        Chicago   Phini
3   gopi  24.0       IT  104000.0         104000.0       New York    Lara
4  vinay  30.0       HR       NaN              NaN  San Francisco     Ken